armfly/H7-TOOL_STM32H7_App/User/daplink/source/hic_hal/stm32/stm32h750/DAP_config.h
//#define GPIO_MODER_MODER0_Pos            (0U)        
//#define GPIO_MODER_MODER0_Msk            (0x3U << GPIO_MODER_MODER0_Pos)       /*!< 0x00000003 */
//#define GPIO_MODER_MODER0                GPIO_MODER_MODER0_Msk           


//#define GPIO_OTYPER_OT_0                 ((uint32_t)0x00000001)    
//#define GPIO_OUTPUT_TYPE      ((uint32_t)0x00000010)
    
      uint32_t temp;

      /*--------------------- GPIO Mode Configuration ------------------------*/

      /* Configure IO Direction mode (Input, Output, Alternate or Analog) */
//      temp = GPIOx->MODER;
//      temp &= ~(GPIO_MODER_MODER0 << (pin_bit * 2));
//      temp |= ((GPIO_Init->Mode & GPIO_MODE) << (position * 2));
//      GPIOx->MODER = temp;
      temp = GPIOx->MODER;
      temp &= ~(0x3U << (pin_bit * 2));
      temp |= ((0x00000001U & 0x00000003) << (pin_bit * 2));
      GPIOx->MODER = temp;        

      /* In case of Output or Alternate function mode selection */
//      if((GPIO_Init->Mode == GPIO_MODE_OUTPUT_PP) || (GPIO_Init->Mode == GPIO_MODE_AF_PP) ||
//         (GPIO_Init->Mode == GPIO_MODE_OUTPUT_OD) || (GPIO_Init->Mode == GPIO_MODE_AF_OD))
//      {
        /* Check the Speed parameter */
//        assert_param(IS_GPIO_SPEED(GPIO_Init->Speed));
//        /* Configure the IO Speed */
//        temp = GPIOx->OSPEEDR; 
//        temp &= ~(GPIO_OSPEEDER_OSPEEDR0 << (position * 2));
//        temp |= (GPIO_Init->Speed << (position * 2));
//        GPIOx->OSPEEDR = temp;

        /* Configure the IO Output Type */
//        temp = GPIOx->OTYPER;
//        temp &= ~(GPIO_OTYPER_OT_0 << pin_bit) ;
//        temp |= (((GPIO_Init->Mode & GPIO_OUTPUT_TYPE) >> 4) << pin_bit);
//        GPIOx->OTYPER = temp;
        
        /* ”≈ªØ */
        temp = GPIOx->OTYPER;
        temp &= ~(0x00000001 << pin_bit) ;
        //temp |= (((0x00000001U & 0x00000010) >> 4) << pin_bit);
        GPIOx->OTYPER = temp;        
//      }

      /* Activate the Pull-up or Pull down resistor for the current IO */
//      temp = GPIOx->PUPDR;
//      temp &= ~(GPIO_PUPDR_PUPDR0 << (position * 2));
//      temp |= ((GPIO_Init->Pull) << (position * 2));
//      GPIOx->PUPDR = temp;    
}


//static __inline void pin_out_od_init(GPIO_TypeDef* GPIOx, uint8_t pin_bit)
//{
//    if(pin_bit >= 8)
//    {
//        GPIOx->CRH &= ~(0x0000000F << ((pin_bit-8) << 2));
//        GPIOx->CRH |= ( ((uint32_t)(0x04|0x03) & 0x0F) << ((pin_bit-8) << 2) );
//    }
//    else
//    {
//        GPIOx->CRL &= ~(0x0000000F << ((pin_bit) << 2));
//        GPIOx->CRL |= ( ((uint32_t)(0x04|0x03) & 0x0F) << ((pin_bit) << 2) );
//    }
//}

//static __inline void pin_in_init(GPIO_TypeDef* GPIOx, uint8_t pin_bit, uint8_t mode)
//{
//    uint8_t config;
//    if(mode == 1)
//        config = 0x08; //Up
//    else if(mode == 2)
//        config = 0x08; //down
//    else
//        config = 0x00; //GPIO_Mode_AIN

//    if(pin_bit >= 8)
//    {
//        GPIOx->CRH &= ~(0x0000000F << ((pin_bit-8) << 2));
//        GPIOx->CRH |= ( ((uint32_t)(config) & 0x0F) << ((pin_bit-8) << 2) );
//        if(mode == 1)
//            GPIOx->BSRR = (((uint32_t)0x01) << pin_bit);
//        else if(mode == 2)
//            GPIOx->BRR = (((uint32_t)0x01) << pin_bit);
//    }
//    else
//    {
//        GPIOx->CRL &= ~(0x0000000F << ((pin_bit) << 2));
//        GPIOx->CRL |= ( ((uint32_t)(config) & 0x0F) << ((pin_bit) << 2) );
//        if(mode == 1)
//            GPIOx->BSRR = (((uint32_t)0x01) << pin_bit);
//        else if(mode == 2)
//            GPIOx->BRR = (((uint32_t)0x01) << pin_bit);
//    }
//}
static __inline void pin_in_init(GPIO_TypeDef* GPIOx, uint8_t pin_bit)
{
//#define  GPIO_MODE_INPUT                        ((uint32_t)0x00000000U)   /*!< Input Floating Mode                   */
//#define  GPIO_MODE_OUTPUT_PP                    ((uint32_t)0x00000001U)   /*!< Output Push Pull Mode                 */
//#define GPIO_MODE             ((uint32_t)0x00000003)

//#define GPIO_MODER_MODER0_Pos            (0U)        
//#define GPIO_MODER_MODER0_Msk            (0x3U << GPIO_MODER_MODER0_Pos)       /*!< 0x00000003 */
//#define GPIO_MODER_MODER0                GPIO_MODER_MODER0_Msk           


//#define GPIO_OTYPER_OT_0                 ((uint32_t)0x00000001)    
//#define GPIO_OUTPUT_TYPE      ((uint32_t)0x00000010)
    
      uint32_t temp;

      /*--------------------- GPIO Mode Configuration ------------------------*/

      /* Configure IO Direction mode (Input, Output, Alternate or Analog) */
//      temp = GPIOx->MODER;
//      temp &= ~(GPIO_MODER_MODER0 << (pin_bit * 2));
//      temp |= ((GPIO_Init->Mode & GPIO_MODE) << (position * 2));
//      GPIOx->MODER = temp;
      temp = GPIOx->MODER;
      temp &= ~(0x3U << (pin_bit * 2));
      //temp |= ((0x00000000U & 0x00000003) << (pin_bit * 2));
      GPIOx->MODER = temp;        

      /* In case of Output or Alternate function mode selection */
//      if((GPIO_Init->Mode == GPIO_MODE_OUTPUT_PP) || (GPIO_Init->Mode == GPIO_MODE_AF_PP) ||
//         (GPIO_Init->Mode == GPIO_MODE_OUTPUT_OD) || (GPIO_Init->Mode == GPIO_MODE_AF_OD))
//      {
        /* Check the Speed parameter */
//        assert_param(IS_GPIO_SPEED(GPIO_Init->Speed));
//        /* Configure the IO Speed */
//        temp = GPIOx->OSPEEDR; 
//        temp &= ~(GPIO_OSPEEDER_OSPEEDR0 << (position * 2));
//        temp |= (GPIO_Init->Speed << (position * 2));
//        GPIOx->OSPEEDR = temp;

        /* Configure the IO Output Type */
//        temp = GPIOx->OTYPER;
//        temp &= ~(GPIO_OTYPER_OT_0 << pin_bit) ;
//        temp |= (((GPIO_Init->Mode & GPIO_OUTPUT_TYPE) >> 4) << pin_bit);
//        GPIOx->OTYPER = temp;
        
        /* ”≈ªØ */
//        temp = GPIOx->OTYPER;
//        temp &= ~(0x00000001 << pin_bit) ;
//        //temp |= (((0x00000000U & 0x00000010) >> 4) << pin_bit);
//        GPIOx->OTYPER = temp;        
//      }

      /* Activate the Pull-up or Pull down resistor for the current IO */
//      temp = GPIOx->PUPDR;
//      temp &= ~(GPIO_PUPDR_PUPDR0 << (position * 2));
//      temp |= ((GPIO_Init->Pull) << (position * 2));
//      GPIOx->PUPDR = temp;    

