armfly/H7-TOOL_STM32H7_App/User/daplink/source/hic_hal/stm32/stm32h750/DAP_config.h
 }

//**************************************************************************************************
/**
\defgroup DAP_Config_PortIO_gr CMSIS-DAP Hardware I/O Pin Access
\ingroup DAP_ConfigIO_gr
@{

Standard I/O Pins of the CMSIS-DAP Hardware Debug Port support standard JTAG mode
and Serial Wire Debug (SWD) mode. In SWD mode only 2 pins are required to implement the debug
interface of a device. The following I/O Pins are provided:

JTAG I/O Pin                 | SWD I/O Pin          | CMSIS-DAP Hardware pin mode
---------------------------- | -------------------- | ---------------------------------------------
TCK: Test Clock              | SWCLK: Clock         | Output Push/Pull
TMS: Test Mode Select        | SWDIO: Data I/O      | Output Push/Pull; Input (for receiving data)
TDI: Test Data Input         |                      | Output Push/Pull
TDO: Test Data Output        |                      | Input
nTRST: Test Reset (optional) |                      | Output Open Drain with pull-up resistor
nRESET: Device Reset         | nRESET: Device Reset | Output Open Drain with pull-up resistor


DAP Hardware I/O Pin Access Functions
-------------------------------------
The various I/O Pins are accessed by functions that implement the Read, Write, Set, or Clear to
these I/O Pins.

For the SWDIO I/O Pin there are additional functions that are called in SWD I/O mode only.
This functions are provided to achieve faster I/O that is possible with some advanced GPIO
peripherals that can independently write/read a single I/O pin without affecting any other pins
of the same I/O port. The following SWDIO I/O Pin functions are provided:
 - \ref PIN_SWDIO_OUT_ENABLE to enable the output mode from the DAP hardware.
 - \ref PIN_SWDIO_OUT_DISABLE to enable the input mode to the DAP hardware.
 - \ref PIN_SWDIO_IN to read from the SWDIO I/O pin with utmost possible speed.
 - \ref PIN_SWDIO_OUT to write to the SWDIO I/O pin with utmost possible speed.
*/


// Configure DAP I/O pins ------------------------------

/** Setup JTAG I/O pins: TCK, TMS, TDI, TDO, nTRST, and nRESET.
Configures the DAP Hardware I/O pins for JTAG mode:
 - TCK, TMS, TDI, nTRST, nRESET to output mode and set to high level.
 - TDO to input mode.
*/
static __inline void PORT_JTAG_SETUP(void)
{
#if (DAP_JTAG != 0)

#endif
}

/** Setup SWD I/O pins: SWCLK, SWDIO, and nRESET.
Configures the DAP Hardware I/O pins for Serial Wire Debug (SWD) mode:
 - SWCLK, SWDIO, nRESET to output mode and set to default high level.
 - TDI, TMS, nTRST to HighZ mode (pins are unused in SWD mode).
*/
static __inline void PORT_SWD_SETUP(void)
{
    GPIO_InitTypeDef gpio_init = {0};

	/* µ⁄1≤Ω£∫¥Úø™GPIO ±÷” */
	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_GPIOE_CLK_ENABLE();
	
	gpio_init.Mode = GPIO_MODE_OUTPUT_PP;	/* …Ë÷√ø™¬© ‰≥ˆ */
	gpio_init.Pull = GPIO_NOPULL;			/* …œœ¬¿≠µÁ◊Ë≤ª πƒ‹ */
	gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;	// GPIO_SPEED_FREQ_HIGH;  /* GPIOÀŸ∂»µ»º∂ */
	
    /* SWCLK */
	gpio_init.Pin = GPIO_PIN_3;	
	HAL_GPIO_Init(GPIOD, &gpio_init);	

    /* SWDIO */	
	gpio_init.Pin = GPIO_PIN_4;	
	HAL_GPIO_Init(GPIOD, &gpio_init);

    /* RESET */	   
    gpio_init.Pull = GPIO_PULLUP;			
    gpio_init.Mode = GPIO_MODE_OUTPUT_OD;    
  	gpio_init.Pin = GPIO_PIN_4;	
	HAL_GPIO_Init(GPIOE, &gpio_init); 

    GPIOD->BSRR = GPIO_PIN_3;
    GPIOD->BSRR = GPIO_PIN_4;
    GPIOE->BSRR = GPIO_PIN_4;
}

/** Disable JTAG/SWD I/O Pins.
Disables the DAP Hardware I/O pins which configures:
 - TCK/SWCLK, TMS/SWDIO, TDI, TDO, nTRST, nRESET to High-Z mode.
*/
static __inline void PORT_OFF(void)
{
    GPIO_InitTypeDef gpio_init = {0};

	/* µ⁄1≤Ω£∫¥Úø™GPIO ±÷” */
	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_GPIOE_CLK_ENABLE();
	
	gpio_init.Mode = GPIO_MODE_INPUT;	    /* …Ë÷√Œ™ ‰»Î */
	gpio_init.Pull = GPIO_NOPULL;			/* …œœ¬¿≠µÁ◊Ë≤ª πƒ‹ */
	gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;	// GPIO_SPEED_FREQ_HIGH;  /* GPIOÀŸ∂»µ»º∂ */
	
    /* SWCLK */
	gpio_init.Pin = GPIO_PIN_3;	
	HAL_GPIO_Init(GPIOD, &gpio_init);	

    /* SWDIO */	
	gpio_init.Pin = GPIO_PIN_4;	
	HAL_GPIO_Init(GPIOD, &gpio_init);
    
    /* RESET */	
	gpio_init.Pin = GPIO_PIN_4;	
	HAL_GPIO_Init(GPIOE, &gpio_init);
}

// SWCLK/TCK I/O pin -------------------------------------

/** SWCLK/TCK I/O pin: Get Input.
\return Current status of the SWCLK/TCK DAP hardware I/O pin.
*/
static __forceinline uint32_t PIN_SWCLK_TCK_IN(void)
{
    return ((SWCLK_TCK_PIN_PORT->ODR & SWCLK_TCK_PIN) ? 1 : 0);
}

/** SWCLK/TCK I/O pin: Set Output to High.
Set the SWCLK/TCK DAP hardware I/O pin to high level.
*/
static __forceinline void PIN_SWCLK_TCK_SET(void)
{
    BSP_SET_GPIO_1(SWCLK_TCK_PIN_PORT, SWCLK_TCK_PIN);
}

/** SWCLK/TCK I/O pin: Set Output to Low.
Set the SWCLK/TCK DAP hardware I/O pin to low level.
*/
static __forceinline void PIN_SWCLK_TCK_CLR(void)
{
    BSP_SET_GPIO_0(SWCLK_TCK_PIN_PORT, SWCLK_TCK_PIN);
}

// SWDIO/TMS Pin I/O --------------------------------------

/** SWDIO/TMS I/O pin: Get Input.
\return Current status of the SWDIO/TMS DAP hardware I/O pin.
*/
static __forceinline uint32_t PIN_SWDIO_TMS_IN(void)
{
    return ((SWDIO_IN_PIN_PORT->IDR & SWDIO_IN_PIN) ? 1 : 0);
}

/** SWDIO/TMS I/O pin: Set Output to High.
Set the SWDIO/TMS DAP hardware I/O pin to high level.
*/
static __forceinline void PIN_SWDIO_TMS_SET(void)
{
    BSP_SET_GPIO_1(SWDIO_OUT_PIN_PORT, SWDIO_OUT_PIN);
}

/** SWDIO/TMS I/O pin: Set Output to Low.
Set the SWDIO/TMS DAP hardware I/O pin to low level.
*/
static __forceinline void PIN_SWDIO_TMS_CLR(void)
{
    BSP_SET_GPIO_0(SWDIO_OUT_PIN_PORT, SWDIO_OUT_PIN);
}

/** SWDIO I/O pin: Get Input (used in SWD mode only).
\return Current status of the SWDIO DAP hardware I/O pin.
*/
static __forceinline uint32_t PIN_SWDIO_IN(void)
{
    return ((SWDIO_IN_PIN_PORT->IDR & SWDIO_IN_PIN) ? 1 : 0);
}

/** SWDIO I/O pin: Set Output (used in SWD mode only).
\param bit Output value for the SWDIO DAP hardware I/O pin.
*/

static __forceinline void PIN_SWDIO_OUT(uint32_t bit)
{
    if (bit & 1)
    {
        BSP_SET_GPIO_1(SWDIO_OUT_PIN_PORT, SWDIO_OUT_PIN);
    }
    else
    {
        BSP_SET_GPIO_0(SWDIO_OUT_PIN_PORT, SWDIO_OUT_PIN);
    }
}

/** SWDIO I/O pin: Switch to Output mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to output mode. This function is
called prior \ref PIN_SWDIO_OUT function calls.
*/
static __forceinline void PIN_SWDIO_OUT_ENABLE(void)
{
//    GPIO_InitTypeDef gpio_init = {0};

    BSP_SET_GPIO_1(GPIOG, GPIO_PIN_9);
    
//	gpio_init.Mode = GPIO_MODE_OUTPUT_PP;	/* …Ë÷√ø™¬© ‰≥ˆ */
//	gpio_init.Pull = GPIO_NOPULL;			/* …œœ¬¿≠µÁ◊Ë≤ª πƒ‹ */
//	gpio_init.Speed = GPIO_SPEED_FREQ_LOW;	// GPIO_SPEED_FREQ_HIGH;  /* GPIOÀŸ∂»µ»º∂ */

//	gpio_init.Pin = GPIO_PIN_4;	
//	HAL_GPIO_Init(GPIOD, &gpio_init);
    
    uint32_t temp;

