armfly/H7-TOOL_STM32H7_App/User/daplink/source/hic_hal/stm32/stm32h750/DAP_config.h
    temp = GPIOD->MODER;
    temp &= 0xFFFFFCFF;
    temp |= 0x00000D00;
    GPIOD->MODER = temp;  

    BSP_SET_GPIO_0(GPIOD, GPIO_PIN_4); 
}

/** SWDIO I/O pin: Switch to Input mode (used in SWD mode only).
Configure the SWDIO DAP hardware I/O pin to input mode. This function is
called prior \ref PIN_SWDIO_IN function calls.
*/
//static __forceinline void PIN_SWDIO_OUT_DISABLE(void)
static  void PIN_SWDIO_OUT_DISABLE(void)
{
//   GPIO_InitTypeDef gpio_init = {0};

    BSP_SET_GPIO_0(GPIOG, GPIO_PIN_9);
    
//	gpio_init.Mode = GPIO_MODE_INPUT;	    /* …Ë÷√ø™¬© ‰≥ˆ */
//	gpio_init.Pull = GPIO_NOPULL;			/* …œœ¬¿≠µÁ◊Ë≤ª πƒ‹ */
//	gpio_init.Speed = GPIO_SPEED_FREQ_LOW;	// GPIO_SPEED_FREQ_HIGH;  /* GPIOÀŸ∂»µ»º∂ */

//	gpio_init.Pin = GPIO_PIN_4;	
//	HAL_GPIO_Init(GPIOD, &gpio_init);

    uint32_t temp;

    temp = GPIOD->MODER;
    temp &= 0xFFFFFCFF;
    GPIOD->MODER = temp;  

    BSP_SET_GPIO_0(GPIOD, GPIO_PIN_4);
}


// TDI Pin I/O ---------------------------------------------

/** TDI I/O pin: Get Input.
\return Current status of the TDI DAP hardware I/O pin.
*/
static __forceinline uint32_t PIN_TDI_IN(void)
{
    return (0);   // Not available
}

/** TDI I/O pin: Set Output.
\param bit Output value for the TDI DAP hardware I/O pin.
*/
static __forceinline void PIN_TDI_OUT(uint32_t bit)
{
    ;             // Not available
}


// TDO Pin I/O ---------------------------------------------

/** TDO I/O pin: Get Input.
\return Current status of the TDO DAP hardware I/O pin.
*/
static __forceinline uint32_t PIN_TDO_IN(void)
{
    return (0);   // Not available
}


// nTRST Pin I/O -------------------------------------------

/** nTRST I/O pin: Get Input.
\return Current status of the nTRST DAP hardware I/O pin.
*/
static __forceinline uint32_t PIN_nTRST_IN(void)
{
    return (0);   // Not available
}

/** nTRST I/O pin: Set Output.
\param bit JTAG TRST Test Reset pin status:
           - 0: issue a JTAG TRST Test Reset.
           - 1: release JTAG TRST Test Reset.
*/
static __forceinline void PIN_nTRST_OUT(uint32_t bit)
{
    ;             // Not available
}

// nRESET Pin I/O------------------------------------------

/** nRESET I/O pin: Get Input.
\return Current status of the nRESET DAP hardware I/O pin.
*/
static __forceinline uint32_t PIN_nRESET_IN(void)
{
    return ((nRESET_PIN_PORT->IDR >> nRESET_PIN_Bit) & 1);
}

/** nRESET I/O pin: Set Output.
\param bit target device hardware reset pin status:
           - 0: issue a device hardware reset.
           - 1: release device hardware reset.
*/
// TODO - sw specific implementation should be created

static __forceinline void     PIN_nRESET_OUT(uint32_t bit)
{
#if 0
    if (bit & 1)
        BSP_SET_GPIO_1(nRESET_PIN_PORT, nRESET_PIN);
    else
        BSP_SET_GPIO_0(nRESET_PIN_PORT, nRESET_PIN);
#else
    if (bit & 1)
    {
        //GPIOE->BSRR = GPIO_PIN_4;
        BSP_SET_GPIO_0(GPIOG, GPIO_PIN_3);      /* PG3 = 0   NRESET = 1 */        
        
    }
    else
    {
        //GPIOE->BSRR = ((uint32_t)GPIO_PIN_4 << 16U);  
        BSP_SET_GPIO_1(GPIOG, GPIO_PIN_3);      /* PG3 = 1   NRESET = 0 */
        
//        /* Á°¨‰ª∂Â§ç‰ΩçÊó∂ÔºåÊâßË°åËΩØ‰ª∂Â§ç‰Ωç */
//        {
//            uint32_t val;

//            swd_read_word(NVIC_AIRCR, &val);

//            swd_write_word(NVIC_AIRCR, VECTKEY | (val & SCB_AIRCR_PRIGROUP_Msk) | SYSRESETREQ);
//            
//            /* ‰∏çÂÅöÂ§ç‰ΩçÈ∏£Âè´‰∫? ‰ΩìÈ™å‰∏çÂ•Ω */
//            //BEEP_Start(5, 1, 1); /* È∏£Âè´50msÔºåÂÅú10msÔº?1Ê¨?*/
//        }
    }
    
#endif
}

//**************************************************************************************************
/**
\defgroup DAP_Config_LEDs_gr CMSIS-DAP Hardware Status LEDs
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware may provide LEDs that indicate the status of the CMSIS-DAP Debug Unit.

It is recommended to provide the following LEDs for status indication:
 - Connect LED: is active when the DAP hardware is connected to a debugger.
 - Running LED: is active when the debugger has put the target device into running state.
*/

/** Debug Unit: Set status of Connected LED.
\param bit status of the Connect LED.
           - 1: Connect LED ON: debugger is connected to CMSIS-DAP Debug Unit.
           - 0: Connect LED OFF: debugger is not connected to CMSIS-DAP Debug Unit.
*/
static __inline void LED_CONNECTED_OUT(uint32_t bit)
{
    if (bit & 1)
        BSP_SET_GPIO_1(CONNECTED_LED_PORT, CONNECTED_LED_PIN);  // LED on
    else
        BSP_SET_GPIO_0(CONNECTED_LED_PORT, CONNECTED_LED_PIN);  // LED off
}

/** Debug Unit: Set status Target Running LED.
\param bit status of the Target Running LED.
           - 1: Target Running LED ON: program execution in target started.
           - 0: Target Running LED OFF: program execution in target stopped.
*/
static __inline void LED_RUNNING_OUT(uint32_t bit)
{
    ;             // Not available
}

///@}


//**************************************************************************************************
/**
\defgroup DAP_Config_Initialization_gr CMSIS-DAP Initialization
\ingroup DAP_ConfigIO_gr
@{

CMSIS-DAP Hardware I/O and LED Pins are initialized with the function \ref DAP_SETUP.
*/

/** Setup of the Debug Unit I/O pins and LEDs (called when Debug Unit is initialized).
This function performs the initialization of the CMSIS-DAP Hardware I/O Pins and the
Status LEDs. In detail the operation of Hardware I/O and LED pins are enabled and set:
 - I/O clock system enabled.
 - all I/O pins: input buffer enabled, output pins are set to HighZ mode.
 - for nTRST, nRESET a weak pull-up (if available) is enabled.
 - LED output pins are enabled and LEDs are turned off.
*/
extern void bsp_InitSPI2_Fast(void);
__inline void DAP_SETUP(void)
{
    GPIO_InitTypeDef gpio_init = {0};

	/* Á¨¨1Ê≠•ÔºöÊâìÂºÄGPIOÊó∂Èíü */
	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_GPIOE_CLK_ENABLE();
	__HAL_RCC_GPIOG_CLK_ENABLE();

    BSP_SET_GPIO_1(GPIOD, GPIO_PIN_3);
    BSP_SET_GPIO_1(GPIOD, GPIO_PIN_4);
    BSP_SET_GPIO_1(GPIOE, GPIO_PIN_4); /* ËÆæÁΩÆ‰∏∫1 */
        
    EIO_D4_Config(ES_GPIO_IN);         /* RESET - ËæìÂÖ•„ÄÇ Áî®PG3ÊéßÂà∂ */
    EIO_D6_Config(ES_GPIO_OUT);        /* SWCLK - ËæìÂá∫ */
    EIO_D8_Config(ES_GPIO_OUT);        /* SWDIO - ËæìÂá∫ */
    EIO_D2_Config(ES_GPIO_OUT);        /* ÊµãËØïÂºïËÑö - ËæìÂá∫ */
    
    /* RESET Áî®PG3Êé®ÊåΩ Á°¨‰ª∂‰∏âÊûÅÁÆ°ÂºÄÊºèÂèçÂêë */	 
    BSP_SET_GPIO_0(GPIOG, GPIO_PIN_3);
    
	gpio_init.Speed = GPIO_SPEED_FREQ_HIGH;	// GPIO_SPEED_FREQ_HIGH;  /* GPIOÈÄüÂ∫¶Á≠âÁ∫ß */   
    gpio_init.Pull = GPIO_PULLUP;			
    gpio_init.Mode = GPIO_MODE_OUTPUT_PP;    
  	gpio_init.Pin = GPIO_PIN_3;	
	HAL_GPIO_Init(GPIOG, &gpio_init);   
    
    #if SPI_MODE_ENABLE == 1
        bsp_InitSPI2_Fast();
    #endif
}

/** Reset Target Device with custom specific I/O pin or command sequence.
This function allows the optional implementation of a device specific reset sequence.
It is called when the command \ref DAP_ResetTarget and is for example required
when a device needs a time-critical unlock sequence that enables the debug port.
\return 0 = no device specific reset sequence is implemented.\n
        1 = a device specific reset sequence is implemented.
*/
static __inline uint32_t RESET_TARGET(void)
{
    return (0);              // change to '1' when a device reset sequence is implemented
}

///@}


#endif /* __DAP_CONFIG_H__ */
